[
  {
    "monitor_id": 1,
    "name": "Logical Disk Average Disk Transfer Time",
    "description": "The Avg. Disk sec/Transfer (LogicalDisk\\Avg. Disk sec/Transfer) for the logical disk has exceeded the threshold. The performance of applications that rely on this logical disk may be negatively impacted as the disk is taking an unusually long time to service read and write requests.",
    "alert_name": "Average Disk Sec/Transfer is too high",
    "alert_description": "The threshold for the Logical Disk\\Avg. Disk Sec/Transfer performance counter has been exceeded. The value that exceeded the threshold is: {0} Sec/Transfer."
  },
  {
    "monitor_id": 2,
    "name": "Logical Disk Disk Health",
    "description": "A logical disk (file system) that was previously online is no longer available.  File system health is determined by inspecting the mount table to identify permanent, mounted file systems. If a mounted file system identified in a previous iteration is not included in the current enumeration, it is considered unhealthy.",
    "alert_name": "Disk is not online",
    "alert_description": "The status for disk is not healthy."
  },
  {
    "monitor_id": 3,
    "name": "Logical Disk Free Space",
    "description": "The amount of free space on the logical disk (file system) is low. System performance may be adversely affected, and the ability to add or modify existing files on the file system may be at risk until additional free space is made available.",
    "alert_name": "% Free Space is too low",
    "alert_description": "The threshold for the Logical Disk % Free Space performance counter has been exceeded. The value that exceeded the threshold is: {0}\\% Free Space."
  },
  {
    "monitor_id": 4,
    "name": "Logical Disk Percent Free Inodes",
    "description": "The percentage of free inodes on the logical disk (file system) is low. System performance may be adversely affected, and the ability to add files on the file system may be at risk until additional inodes are made available.",
    "alert_name": "% Free Inodes is too low",
    "alert_description": "The threshold for the Logical Disk\\\\% Free inodes performance counter has been exceeded. The value that exceeded the threshold is: {0}\\% Free Inodes."
  },
  {
    "monitor_id": 5,
    "name": "Logical Disk Percent Free Space",
    "description": "The percentage of free space on the logical disk (file system) is low. System performance may be adversely affected, and the ability to add or modify existing files on the file system may be at risk until additional free space is made available.",
    "alert_name": "% Free Space is too low",
    "alert_description": "The threshold for the Logical Disk\\\\% Free Space performance counter has been exceeded. The value that exceeded the threshold is: {0}\\% Free Space."
  },
  {
    "monitor_id": 6,
    "name": "Network Adapter Health",
    "description": "The network adapter has been disconnected from the network and no longer has network connectivity.  Network adapter health is determined by identifying network adapters that are Up or Running (as defined by the device flags: IFF_RUNNING and IFF_UP of the ioctl: SIOCGIFFLAGS). If a network adapter that was identified as Up or Running is no longer Up or Running, it is considered unhealthy.",
    "alert_name": "Network Adapter Connection Health",
    "alert_description": "The status for network adapter {0} is not healthy."
  },
  {
    "monitor_id": 7,
    "name": "Operating System Available MBytes",
    "description": "Available megabytes of memory is low. System performance may be adversely affected.  The available megabytes memory value represents the sum of MemFree, Buffers and Cached as reported by the operating system.",
    "alert_name": "Available MegaBytes Memory is too low",
    "alert_description": "The threshold for the Memory\\Available MBytes performance counter has been exceeded. The value that exceeded the threshold is: {0} Available MBytes."
  },
  {
    "monitor_id": 8,
    "name": "Operating System Available MBytes Swap",
    "description": "Available megabytes of swap space is low. System performance may be adversely affected.  The available megabytes of swap space value represents the free swap space, as reported by the operating system.",
    "alert_name": "Available MegaBytes Swap Space is too low",
    "alert_description": "The threshold for the Swap Space\\Available MBytes performance counter has been exceeded. The value that exceeded the threshold is: {0} Available MBytes."
  },
  {
    "monitor_id": 9,
    "name": "Operating System Total Percent DPC Time",
    "description": "The total percentage of DPC time (for all processors) is high. System performance may be adversely affected.  Total DPC time is the time that all processors spent receiving and servicing deferred procedure calls (DPCs). DPCs are interrupts that run at a lower priority than standard interrupts. % DPC Time is a component of % Privileged Time because DPCs are executed in privileged mode. If a high % DPC Time is sustained, there may be a processor bottleneck or an application or hardware related issue that can significantly diminish overall system performance.",
    "alert_name": "Total DPC Time Percentage is too high",
    "alert_description": "The threshold for the Processor\\\\% DPC Time\\_Total performance counter has been exceeded. The value that exceeded the threshold is: {0}."
  },
  {
    "monitor_id": 10,
    "name": "Operating System Total Percent Interrupt Time",
    "description": "The total percentage of interrupt time (for all processors) is high. System performance may be adversely affected.  Total interrupt time is the time that all processors spent receiving and servicing hardware interrupts. This value is an indirect indicator of the activity of devices that generate interrupts, such as the system clock, the mouse, storage controllers, data communication lines, network interface cards and other peripheral devices. These devices normally interrupt the processor when they have completed a task or require attention. Normal thread execution is suspended during interrupts.",
    "alert_name": "Total Percentage Interrupt Time is too high",
    "alert_description": "The threshold for the Processor\\\\% Interrupt Time\\_Total performance counter has been exceeded. The value that exceeded the threshold is: {0}."
  },
  {
    "monitor_id": 11,
    "name": "Operating System Total Percent Processor Time",
    "description": "The total percentage of processor time (for all processors) is high. System performance may be adversely affected.  Total processor time is the time that all processors spent running a non-idle thread. Each processor has an idle thread that consumes cycles when no other threads are ready to run. This metric is the primary indicator of processor activity, and displays the average percentage of busy time observed.",
    "alert_name": "Total CPU Utilization Percentage is too high",
    "alert_description": "The threshold for the Processor\\\\% Processor Time\\_Total performance counter has been exceeded. The values that exceeded the threshold are: {0}."
  },
  {
    "monitor_id": 12,
    "name": "Physical Disk Average Disk Read Time",
    "description": "The average time per read (for the physical disk) is high. System performance may be adversely affected.  The average physical disk time per read is measured in seconds. A disk that is developing a bottleneck might cause the entire system to slow.",
    "alert_name": "Average Disk Sec/Read is too high",
    "alert_description": "The threshold for the Physical Disk\\Avg. Disk Sec/Read performance counter has been exceeded. The value that exceeded the threshold is: {0} Sec/Read."
  },
  {
    "monitor_id": 13,
    "name": "Physical Disk Average Disk Transfer Time",
    "description": "The average time per transfer (for the physical disk) is high. System performance may be adversely affected.  The average physical disk time per transfer is measured in seconds. A disk that is developing a bottleneck might cause the entire system to slow.",
    "alert_name": "Average Disk Sec/Transfer is too high",
    "alert_description": "The threshold for the Physical Disk\\Avg. Disk Sec/Transfer performance counter has been exceeded. The value that exceeded the threshold is: {0} Sec/Transfer."
  },
  {
    "monitor_id": 14,
    "name": "Physical Disk Average Disk Write Time",
    "description": "The average time per write (for the physical disk) is high. System performance may be adversely affected.  The average physical disk time per write is measured in seconds. A disk that is developing a bottleneck might cause the entire system to slow.",
    "alert_name": "Average Disk Sec/Write is too high",
    "alert_description": "The threshold for the Physical Disk\\Avg. Disk Sec/Write performance counter has been exceeded. The value that exceeded the threshold is: {0} Sec/Write."
  },
  {
    "monitor_id": 15,
    "name": "Physical Disk Disk Health",
    "description": "A physical disk that was previously available is no longer available.  Physical disk health is determined by inspecting the physical disks associated with mounted file systems. If a physical disk that was available in a previous iteration is not included in the current enumeration, it is considered unhealthy.",
    "alert_name": "Disk is not online",
    "alert_description": "The status for disk {0} is not healthy."
  },
  {
    "monitor_id": 16,
    "name": "Process Acpi",
    "description": "This process monitor watches for the ACPI Daemon process to be running.",
    "alert_name": "Process Acpi Monitor Alert",
    "alert_description": "The ACPI daemon on server {0} is not running."
  },
  {
    "monitor_id": 17,
    "name": "Process Audit",
    "description": "This process monitor watches for the Audit Daemon process to be running.",
    "alert_name": "Process Audit Monitor Alert",
    "alert_description": "The Audit daemon on server {0} is not running."
  },
  {
    "monitor_id": 18,
    "name": "Process Cron",
    "description": "This process monitor watches for the Cron Daemon process to be running.",
    "alert_name": "Process Cron Monitor Alert",
    "alert_description": "The Cron daemon on server {0} is not running."
  },
  {
    "monitor_id": 19,
    "name": "Process Klog",
    "description": "This process monitor watches for the Klog Daemon process to be running.",
    "alert_name": "Process Klog Monitor Alert",
    "alert_description": "The Klog daemon on server {0} is not running."
  },
  {
    "monitor_id": 20,
    "name": "Process Portmap",
    "description": "This process monitor watches for the Portmap Daemon process to be running.",
    "alert_name": "Process Portmap Monitor Alert",
    "alert_description": "The Portmap daemon on server {0} is not running."
  },
  {
    "monitor_id": 21,
    "name": "Process Pwgr",
    "description": "This process monitor watches for the Pwgr Daemon process to be running.",
    "alert_name": "Process Pwgr Monitor Alert",
    "alert_description": "The Pwgr daemon on server {0} is not running."
  },
  {
    "monitor_id": 22,
    "name": "Process Rpcbind",
    "description": "This process monitor watches for the Rpcbind Daemon process to be running.",
    "alert_name": "Process Rpcbind Monitor Alert",
    "alert_description": "The Rcpbind daemon on server {0} is not running."
  },
  {
    "monitor_id": 23,
    "name": "Process Rpcidmap",
    "description": "This process monitor watches for the Rpcidmap Daemon process to be running.",
    "alert_name": "Process Rpcidmap Monitor Alert",
    "alert_description": "The Rpcidmap daemon on server {0} is not running."
  },
  {
    "monitor_id": 24,
    "name": "Process Rpcstat",
    "description": "This process monitor watches for the Rpcstat Daemon process to be running.",
    "alert_name": "Process Rpcstat Monitor Alert",
    "alert_description": "The Rpcstat daemon on server {0} is not running."
  },
  {
    "monitor_id": 25,
    "name": "Process Ssh",
    "description": "This process monitor watches for the Ssh Daemon process to be running.",
    "alert_name": "Process Ssh Monitor Alert",
    "alert_description": "The Ssh daemon on server {0} is not running."
  },
  {
    "monitor_id": 26,
    "name": "Process Syslog",
    "description": "This process monitor watches for the Syslog Daemon process to be running.",
    "alert_name": "Process Syslog Monitor Alert",
    "alert_description": "The Syslog daemon on server {0} is not running."
  },
  {
    "monitor_id": 27,
    "name": "Process Udev",
    "description": "This process monitor watches for the Udev Daemon process to be running.",
    "alert_name": "Process Udev Monitor Alert",
    "alert_description": "The Udev daemon on server {0} is not running."
  },
  {
    "monitor_id": 28,
    "name": "Processor Percent DPC Time",
    "description": "This monitor checks the Total Percent DPC Time for the system. If you receive an alert from this monitor, action can be required in order to bring the system back to an operational state.  Percent DPC Time is the percentage of time that the processor spends receiving and servicing deferred procedure calls (DPCs). DPCs, or soft interrupts, are interrupts that run at a lower priority than standard interrupts. If a High % DPC Time is sustained there may be a processor bottleneck or an application or hardware related issue that can significantly diminish overall system performance.",
    "alert_name": "DPC Time Percentage is too high",
    "alert_description": "The threshold for the Processor\\\\% DPC Time\\ performance counter has been exceeded. The value that exceeded the threshold is: {0}."
  },
  {
    "monitor_id": 29,
    "name": "Processor Percent Interrupt Time",
    "description": "This monitor checks the Total Percent Interrupt Time for the system. If you receive an alert from this monitor, action can be required in order to bring the system back to an operational state.  Percent Interrupt Time is the time the processor spends receiving and servicing hardware interrupts during sample intervals. This value is an indirect indicator of the activity of devices that generate interrupts, such as the system clock, disk drivers, data communication lines, network interface cards, and other peripheral devices. These devices normally interrupt the processor when they have completed a task or require attention.",
    "alert_name": "Percentage Interrupt Time is too high",
    "alert_description": "The threshold for the Processor\\\\% Interrupt Time\\ performance counter has been exceeded. The value that exceeded the threshold is: {0}."
  },
  {
    "monitor_id": 30,
    "name": "Processor Percent Processor Time",
    "description": "This monitor checks the Percent Processor Time for each processor. If you receive an alert from this monitor, action can be required in order to bring the system back to an operational state.  The Percent Processor Time is the percentage of time the processor was busy during the sampling interva",
    "alert_name": "CPU Utilization Percentage is too high",
    "alert_description": "The threshold for the Processor\\\\% Processor Time\\ performance counter has been exceeded. The values that exceeded the threshold are: {0}\\%."
  },
  {
    "monitor_id": 31,
    "name": "Heartbeat Monitor",
    "description": "This monitor checks if the device is up",
    "alert_name": "Heartbeat failure",
    "alert_description": "The device is not sending heartbeats"
  }
]